Revit 2027 API
TextNote.LeaderCount Property
 Number of leader objects currently attached to the text note.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int LeaderCount { get; }
Public ReadOnly Property LeaderCount As Integer
	Get
public:
property int LeaderCount {
	int get ();
}
member LeaderCount : int with get
Property Value
Int32
See Also
Reference
TextNote Class
Autodesk.Revit.DB Namespace